# GetFabricRoundingManager Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementSettings..::..GetFabricRoundingManager Method
ReinforcementSettings Class See Also
---
Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FabricRoundingManager GetFabricRoundingManager()
```

Visual Basic
---
```text
Public Function GetFabricRoundingManager As FabricRoundingManager
```

Visual C++
---
```text
public:
FabricRoundingManager^ GetFabricRoundingManager()
```

# ### Return Value
The rounding manager.
# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace